package fi.lahti.unit_4.string;

/*
1. Создать окно для клиентской части чата: большое текстовое поле для отображения переписки в центре окна. Однострочное текстовое поле для ввода сообщений и кнопка для отсылки сообщений на нижней панели.
Сообщение должно отсылаться либо по нажатию кнопки на форме, либо по нажатию кнопки Enter.
При «отсылке» сообщение перекидывается из нижнего поля в центральное.
 * 2. Создать TreeMap<String, Integer>.
 Данная коллекция по-умолчанию сортирует по ключу.
 Сделать так, чтобы сортировка производилась по значению.
 К примеру, при значениях 3, 10, 1 (значения ключений могут быть любыми) toString будет выводить всю структуру отсортированную по значениями {"4"=1}, {"101"=3}, {"-1"=10}
 */


import java.util.TreeMap;

public class AppsStart {

    public static void main(String[] args) {


        R my = new R();
        my.w();
        my.print();





    }


}
